#### Write a Pandas program to convert all the string values to upper, lower cases in a given pandas series. Also find the length of the string values.

In [2]:
import pandas as pd
import numpy as np

In [2]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [3]:
s = df['name']
s

a    Anastasia
b         Dima
c    Katherine
d        James
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object

In [4]:
s.str.upper()

a    ANASTASIA
b         DIMA
c    KATHERINE
d        JAMES
e        EMILY
f      MICHAEL
g      MATTHEW
h        LAURA
i        KEVIN
j        JONAS
Name: name, dtype: object

In [5]:
s.str.lower()

a    anastasia
b         dima
c    katherine
d        james
e        emily
f      michael
g      matthew
h        laura
i        kevin
j        jonas
Name: name, dtype: object

#### Write a Pandas program to remove whitespaces, left sided whitespaces and right sided whitespaces of the string values of a given pandas series.

In [7]:
color1 = pd.Index([' Green', 'Black ', ' Red ', 'White', ' Pink '])
color1

Index([' Green', 'Black ', ' Red ', 'White', ' Pink '], dtype='object')

In [9]:
print("\nRemove whitespace")
color1.str.strip()

Remove whitespace

Index(['Green', 'Black', 'Red', 'White', 'Pink'], dtype='object')

In [10]:
print("\nRemove left sided whitespace")
color1.str.lstrip()

Remove left sided whitespace

Index(['Green', 'Black ', 'Red ', 'White', 'Pink '], dtype='object')

In [12]:
print("\nRemove Right sided whitespace")
color1.str.rstrip()

Remove Right sided whitespace

Index([' Green', 'Black', ' Red', 'White', ' Pink'], dtype='object')

#### Write a Pandas program to add leading zeros to the integer column in a pandas series and makes the length of the field to 8 digit.

In [13]:
nums = {'amount': [10, 250, 3000, 40000, 500000]}
print("Original dataframe:")
df = pd.DataFrame(nums)
df

Original dataframe:

   amount
0      10
1     250
2    3000
3   40000
4  500000

In [14]:
df['amount'] = df['amount'].apply(lambda x: '{0:0>8}'.format(x))
df

     amount
0  00000010
1  00000250
2  00003000
3  00040000
4  00500000

#### Write a Pandas program to add leading zeros to the character column in a pandas series and makes the length of the field to 8 digit.

In [15]:
df = pd.DataFrame({
    'name': ['alberto','gino','ryan', 'Eesha', 'syed'],
    'date_of_birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
df

Original DataFrame:

      name date_of_birth    age
0  alberto     17/05/2002  18.5
1     gino     16/02/1999  21.2
2     ryan     25/09/1998  22.5
3    Eesha     11/05/2002  22.0
4     syed     15/09/1997  23.0

In [16]:
print("\nAfter capitalizing name column:")
df['name'] = list(map(lambda x: x.capitalize(), df['name']))
df

After capitalizing name column:

      name date_of_birth    age
0  Alberto     17/05/2002  18.5
1     Gino     16/02/1999  21.2
2     Ryan     25/09/1998  22.5
3    Eesha     11/05/2002  22.0
4     Syed     15/09/1997  23.0

#### Write a Pandas program to count of occurrence of a specified substring in a DataFrame column.

In [17]:
df = pd.DataFrame({
    'name_code': ['c001','c002','c022', 'c2002', 'c2222'],
    'date_of_birth ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
df

Original DataFrame:

  name_code date_of_birth    age
0      c001     12/05/2002  18.5
1      c002     16/02/1999  21.2
2      c022     25/09/1998  22.5
3     c2002     12/02/2022  22.0
4     c2222     15/09/1997  23.0

In [18]:
print("\nCount occurrence of 2 in date_of_birth column:")
df['count'] = list(map(lambda x: x.count("2"), df['name_code']))
df

Count occurrence of 2 in date_of_birth column:

  name_code date_of_birth    age  count
0      c001     12/05/2002  18.5      0
1      c002     16/02/1999  21.2      1
2      c022     25/09/1998  22.5      2
3     c2002     12/02/2022  22.0      2
4     c2222     15/09/1997  23.0      4

#### Write a Pandas program to find the index of a substring of DataFrame with beginning and end position.

In [19]:
df = pd.DataFrame({
    'name_code': ['c0001','1000c','b00c2', 'b2c02', 'c2222'],
    'date_of_birth ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
df

Original DataFrame:

  name_code date_of_birth    age
0     c0001     12/05/2002  18.5
1     1000c     16/02/1999  21.2
2     b00c2     25/09/1998  22.5
3     b2c02     12/02/2022  22.0
4     c2222     15/09/1997  23.0

In [20]:
print("\nIndex of a substring in a specified column of a dataframe:")
df['Index'] = list(map(lambda x: x.find('c', 0, 5), df['name_code']))
df

Index of a substring in a specified column of a dataframe:

  name_code date_of_birth    age  Index
0     c0001     12/05/2002  18.5      0
1     1000c     16/02/1999  21.2      4
2     b00c2     25/09/1998  22.5      3
3     b2c02     12/02/2022  22.0      2
4     c2222     15/09/1997  23.0      0

#### Write a Pandas program to check whether alpha numeric values present in a given column of a DataFrame.

In [21]:
df = pd.DataFrame({
    'name_code': ['Company','Company a001','Company 123', '1234', 'Company 12'],
    'date_of_birth ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
df

Original DataFrame:

      name_code date_of_birth    age
0       Company     12/05/2002  18.5
1  Company a001     16/02/1999  21.2
2   Company 123     25/09/1998  22.5
3          1234     12/02/2022  22.0
4    Company 12     15/09/1997  23.0

In [22]:
print("\nWhether all characters in the string are alphanumeric?")
df['name_code_is_alphanumeric'] = list(map(lambda x: x.isalnum(), df['name_code']))
df

Whether all characters in the string are alphanumeric?

      name_code date_of_birth    age  name_code_is_alphanumeric
0       Company     12/05/2002  18.5                       True
1  Company a001     16/02/1999  21.2                      False
2   Company 123     25/09/1998  22.5                      False
3          1234     12/02/2022  22.0                       True
4    Company 12     15/09/1997  23.0                      False

#### Write a Pandas program to check whether alphabetic values present in a given column of a DataFrame.

In [23]:
df = pd.DataFrame({
    'company_code': ['Company','Company a001','Company 123', 'abcd', 'Company 12'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})

print("Original DataFrame:")
df

Original DataFrame:

   company_code date_of_sale   sale_amount
0       Company    12/05/2002      12348.5
1  Company a001    16/02/1999     233331.2
2   Company 123    25/09/1998         22.5
3          abcd    12/02/2022    2566552.0
4    Company 12    15/09/1997         23.0

In [24]:
print("\nWhether Alphabetic values present in company_code column?")
df['company_code_is_alpha'] = list(map(lambda x: x.isalpha(), df['company_code']))
df

Whether Alphabetic values present in company_code column?

   company_code date_of_sale   sale_amount  company_code_is_alpha
0       Company    12/05/2002      12348.5                   True
1  Company a001    16/02/1999     233331.2                  False
2   Company 123    25/09/1998         22.5                  False
3          abcd    12/02/2022    2566552.0                   True
4    Company 12    15/09/1997         23.0                  False

#### Write a Pandas program to find the index of a given substring of a DataFrame column.

In [25]:
df = pd.DataFrame({
    'name_code': ['c001','c002','c022', 'c2002', 'c2222'],
    'date_of_birth ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
df

Original DataFrame:

  name_code date_of_birth    age
0      c001     12/05/2002  18.5
1      c002     16/02/1999  21.2
2      c022     25/09/1998  22.5
3     c2002     12/02/2022  22.0
4     c2222     15/09/1997  23.0

In [26]:
print("\nCount occurrence of 22 in date_of_birth column:")
df['Index'] = list(map(lambda x: x.find('22'), df['name_code']))
df

Count occurrence of 22 in date_of_birth column:

  name_code date_of_birth    age  Index
0      c001     12/05/2002  18.5     -1
1      c002     16/02/1999  21.2     -1
2      c022     25/09/1998  22.5      2
3     c2002     12/02/2022  22.0     -1
4     c2222     15/09/1997  23.0      1

#### Write a Pandas program to check whether only numeric values present in a given column of a DataFrame.

In [27]:
df = pd.DataFrame({
    'company_code': ['Company','Company a001', '2055', 'abcd', '123345'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})

print("Original DataFrame:")
df

Original DataFrame:

   company_code date_of_sale   sale_amount
0       Company    12/05/2002      12348.5
1  Company a001    16/02/1999     233331.2
2          2055    25/09/1998         22.5
3          abcd    12/02/2022    2566552.0
4        123345    15/09/1997         23.0

In [28]:
print("\nNumeric values present in company_code column:")
df['company_code_is_digit'] = list(map(lambda x: x.isdigit(), df['company_code']))
df

Numeric values present in company_code column:

   company_code date_of_sale   sale_amount  company_code_is_digit
0       Company    12/05/2002      12348.5                  False
1  Company a001    16/02/1999     233331.2                  False
2          2055    25/09/1998         22.5                   True
3          abcd    12/02/2022    2566552.0                  False
4        123345    15/09/1997         23.0                   True

#### Write a Pandas program to check whether only lower case or upper case is present in a given column of a DataFrame.

In [29]:
df = pd.DataFrame({
    'company_code': ['ABCD','EFGF', 'hhhh', 'abcd', 'EAWQaaa'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})
df

  company_code date_of_sale   sale_amount
0         ABCD    12/05/2002      12348.5
1         EFGF    16/02/1999     233331.2
2         hhhh    25/09/1998         22.5
3         abcd    12/02/2022    2566552.0
4      EAWQaaa    15/09/1997         23.0

In [30]:
print("\nIs lower (company_code)?")
df['company_code_ul_cases'] = list(map(lambda x: x.islower(), df['company_code']))
df

Is lower (company_code)?

  company_code date_of_sale   sale_amount  company_code_ul_cases
0         ABCD    12/05/2002      12348.5                  False
1         EFGF    16/02/1999     233331.2                  False
2         hhhh    25/09/1998         22.5                   True
3         abcd    12/02/2022    2566552.0                   True
4      EAWQaaa    15/09/1997         23.0                  False

In [31]:
print("\nIs Upper (company_code)?")
df['company_code_ul_cases'] = list(map(lambda x: x.isupper(), df['company_code']))
df

Is Upper (company_code)?

  company_code date_of_sale   sale_amount  company_code_ul_cases
0         ABCD    12/05/2002      12348.5                   True
1         EFGF    16/02/1999     233331.2                   True
2         hhhh    25/09/1998         22.5                  False
3         abcd    12/02/2022    2566552.0                  False
4      EAWQaaa    15/09/1997         23.0                  False

#### Write a Pandas program to check whether only proper case or title case is present in a given column of a DataFrame.

In [32]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'Hhhh', 'abcd', 'EAWQaaa'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})

print("Original DataFrame:")
df

Original DataFrame:

  company_code date_of_sale   sale_amount
0         Abcd    12/05/2002      12348.5
1         EFGF    16/02/1999     233331.2
2         Hhhh    25/09/1998         22.5
3         abcd    12/02/2022    2566552.0
4      EAWQaaa    15/09/1997         23.0

In [33]:
print("\nIs proper case or title case?")
df['company_code_is_title'] = list(map(lambda x: x.istitle(), df['company_code']))
df

Is proper case or title case?

  company_code date_of_sale   sale_amount  company_code_is_title
0         Abcd    12/05/2002      12348.5                   True
1         EFGF    16/02/1999     233331.2                  False
2         Hhhh    25/09/1998         22.5                   True
3         abcd    12/02/2022    2566552.0                  False
4      EAWQaaa    15/09/1997         23.0                  False

#### Write a Pandas program to check whether only space is present in a given column of a DataFrame.

In [34]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF ', '  ', 'abcd', ' '],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})

print("Original DataFrame:")
df

Original DataFrame:

  company_code date_of_sale   sale_amount
0         Abcd    12/05/2002      12348.5
1        EFGF     16/02/1999     233331.2
2                 25/09/1998         22.5
3         abcd    12/02/2022    2566552.0
4                 15/09/1997         23.0

In [35]:
print("\nIs space is present?")
df['company_code_is_title'] = list(map(lambda x: x.isspace(), df['company_code']))
df

Is space is present?

  company_code date_of_sale   sale_amount  company_code_is_title
0         Abcd    12/05/2002      12348.5                  False
1        EFGF     16/02/1999     233331.2                  False
2                 25/09/1998         22.5                   True
3         abcd    12/02/2022    2566552.0                  False
4                 15/09/1997         23.0                   True

#### Write a Pandas program to get the length of the string present of a given column in a DataFrame.

In [36]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'skfsalf', 'sdfslew', 'safsdf'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})
print("Original DataFrame:")
df

Original DataFrame:

  company_code date_of_sale   sale_amount
0         Abcd    12/05/2002      12348.5
1         EFGF    16/02/1999     233331.2
2      skfsalf    25/09/1998         22.5
3      sdfslew    12/02/2022    2566552.0
4       safsdf    15/09/1997         23.0

In [37]:
print("\nLength of the string in a column:")
df['company_code_length'] = df['company_code'].apply(len)
df

Length of the string in a column:

  company_code date_of_sale   sale_amount  company_code_length
0         Abcd    12/05/2002      12348.5                    4
1         EFGF    16/02/1999     233331.2                    4
2      skfsalf    25/09/1998         22.5                    7
3      sdfslew    12/02/2022    2566552.0                    7
4       safsdf    15/09/1997         23.0                    6

#### Write a Pandas program to get the length of the integer of a given column in a DataFrame.

In [38]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'skfsalf', 'sdfslew', 'safsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
print("Original DataFrame:")
df

Original DataFrame:

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      skfsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4       safsdf   15/09/1997         23.0

In [39]:
print("\nLength of sale_amount:")
df['sale_amount_length'] = df['sale_amount'].map(str).apply(len)
df

Length of sale_amount:

  company_code date_of_sale  sale_amount  sale_amount_length
0         Abcd   12/05/2002      12348.5                   7
1         EFGF   16/02/1999     233331.2                   8
2      skfsalf   25/09/1998         22.5                   4
3      sdfslew   12/02/2022    2566552.0                   9
4       safsdf   15/09/1997         23.0                   4

#### Write a Pandas program to check if a specified column starts with a specified string in a DataFrame.

In [40]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
print("Original DataFrame:")
df

Original DataFrame:

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      zefsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4      zekfsdf   15/09/1997         23.0

In [41]:
print("\nIf a specified column starts with a specified string?")
df['company_code_starts_with'] = list(
    map(lambda x: x.startswith('ze'), df['company_code']))

df

If a specified column starts with a specified string?

  company_code date_of_sale  sale_amount  company_code_starts_with
0         Abcd   12/05/2002      12348.5                     False
1         EFGF   16/02/1999     233331.2                     False
2      zefsalf   25/09/1998         22.5                      True
3      sdfslew   12/02/2022    2566552.0                     False
4      zekfsdf   15/09/1997         23.0                      True

#### Write a Pandas program to swap the cases of a specified character column in a given DataFrame.

In [42]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
print("Original DataFrame:")
df

Original DataFrame:

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      zefsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4      zekfsdf   15/09/1997         23.0

In [43]:
df['swapped_company_code'] = list(map(lambda x: x.swapcase(), df['company_code']))
df

  company_code date_of_sale  sale_amount swapped_company_code
0         Abcd   12/05/2002      12348.5                 aBCD
1         EFGF   16/02/1999     233331.2                 efgf
2      zefsalf   25/09/1998         22.5              ZEFSALF
3      sdfslew   12/02/2022    2566552.0              SDFSLEW
4      zekfsdf   15/09/1997         23.0              ZEKFSDF

#### Write a Pandas program to convert a specified character column in upper/lower cases in a given DataFrame.

In [46]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})

df1 = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})

df

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      zefsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4      zekfsdf   15/09/1997         23.0

In [47]:
df['upper_company_code'] = list(map(lambda x: x.upper(), df['company_code']))
df

  company_code date_of_sale  sale_amount upper_company_code
0         Abcd   12/05/2002      12348.5               ABCD
1         EFGF   16/02/1999     233331.2               EFGF
2      zefsalf   25/09/1998         22.5            ZEFSALF
3      sdfslew   12/02/2022    2566552.0            SDFSLEW
4      zekfsdf   15/09/1997         23.0            ZEKFSDF

#### Write a Pandas program to convert a specified character column in title case in a given DataFrame.

In [48]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
df

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      zefsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4      zekfsdf   15/09/1997         23.0

In [49]:
df['company_code_title_cases'] = list(map(lambda x: x.title(), df['company_code']))
df

  company_code date_of_sale  sale_amount company_code_title_cases
0         Abcd   12/05/2002      12348.5                     Abcd
1         EFGF   16/02/1999     233331.2                     Efgf
2      zefsalf   25/09/1998         22.5                  Zefsalf
3      sdfslew   12/02/2022    2566552.0                  Sdfslew
4      zekfsdf   15/09/1997         23.0                  Zekfsdf

#### Write a Pandas program to replace arbitrary values with other values in a given DataFrame.

In [50]:
df = pd.DataFrame({
    'company_code': ['A','B', 'C', 'D', 'A'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
df

  company_code date_of_sale  sale_amount
0            A   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            C   25/09/1998         22.5
3            D   12/02/2022    2566552.0
4            A   15/09/1997         23.0

In [51]:
print("\nReplace A with c:")
df = df.replace("A", "C")
df

Replace A with c:

  company_code date_of_sale  sale_amount
0            C   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            C   25/09/1998         22.5
3            D   12/02/2022    2566552.0
4            C   15/09/1997         23.0

#### Write a Pandas program to split a string of a column of a given DataFrame into multiple columns.

In [52]:
df = pd.DataFrame({
    'name': ['Alberto  Franco','Gino Ann Mcneill','Ryan  Parkes', 'Eesha Artur Hinton', 'Syed  Wharton'],
    'date_of_birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
df

                 name date_of_birth    age
0     Alberto  Franco     17/05/2002  18.5
1    Gino Ann Mcneill     16/02/1999  21.2
2        Ryan  Parkes     25/09/1998  22.5
3  Eesha Artur Hinton     11/05/2002  22.0
4       Syed  Wharton     15/09/1997  23.0

In [53]:
df[["first", "middle", "last"]] = df["name"].str.split(" ", expand = True)
print("\nNew DataFrame:")
df

New DataFrame:

                 name date_of_birth    age    first middle     last
0     Alberto  Franco     17/05/2002  18.5  Alberto          Franco
1    Gino Ann Mcneill     16/02/1999  21.2     Gino    Ann  Mcneill
2        Ryan  Parkes     25/09/1998  22.5     Ryan          Parkes
3  Eesha Artur Hinton     11/05/2002  22.0    Eesha  Artur   Hinton
4       Syed  Wharton     15/09/1997  23.0     Syed         Wharton

#### Write a Pandas program to extract email from a specified column of string type of a given DataFrame.

In [3]:
import re as re
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'name_email': ['Alberto Franco af@gmail.com','Gino Mcneill gm@yahoo.com','Ryan Parkes rp@abc.io', 'Eesha Hinton', 'Gino Mcneill gm@github.com']
    })
print("Original DataFrame:")
df

Original DataFrame:

                    name_email
0  Alberto Franco af@gmail.com
1    Gino Mcneill gm@yahoo.com
2        Ryan Parkes rp@abc.io
3                 Eesha Hinton
4   Gino Mcneill gm@github.com

In [4]:
def find_email(text):
    email = re.findall(r'[\w\.-]+@[\w\.-]+',str(text))
    return ",".join(email)

In [5]:
df['email']=df['name_email'].apply(lambda x: find_email(x))
df

                    name_email          email
0  Alberto Franco af@gmail.com   af@gmail.com
1    Gino Mcneill gm@yahoo.com   gm@yahoo.com
2        Ryan Parkes rp@abc.io      rp@abc.io
3                 Eesha Hinton
4   Gino Mcneill gm@github.com  gm@github.com

#### Write a Pandas program to extract hash attached word from twitter text from the specified column of a given DataFrame.

In [6]:
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'tweets': ['#Obama says goodbye','Retweets for #cash','A political endorsement in #Indonesia', '1 dog = many #retweets', 'Just a simple #egg']
    })
print("Original DataFrame:")
df

Original DataFrame:

                                  tweets
0                    #Obama says goodbye
1                     Retweets for #cash
2  A political endorsement in #Indonesia
3                 1 dog = many #retweets
4                     Just a simple #egg

In [7]:
def find_hash(text):
    hword=re.findall(r'(?<=#)\w+',text)
    return " ".join(hword)

In [8]:
df['hash_word']=df['tweets'].apply(lambda x: find_hash(x))
df

                                  tweets  hash_word
0                    #Obama says goodbye      Obama
1                     Retweets for #cash       cash
2  A political endorsement in #Indonesia  Indonesia
3                 1 dog = many #retweets   retweets
4                     Just a simple #egg        egg

#### Write a Pandas program to extract word mention someone in tweets using @ from the specified column of a given DataFrame.

In [9]:
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'tweets': ['@Obama says goodbye','Retweets for @cash','A political endorsement in @Indonesia', '1 dog = many #retweets', 'Just a simple #egg']
    })
print("Original DataFrame:")

df

Original DataFrame:

                                  tweets
0                    @Obama says goodbye
1                     Retweets for @cash
2  A political endorsement in @Indonesia
3                 1 dog = many #retweets
4                     Just a simple #egg

In [10]:
def find_at_word(text):
    word=re.findall(r'(?<=@)\w+',text)
    return " ".join(word)

In [11]:
df['at_word']=df['tweets'].apply(lambda x: find_at_word(x))
df

                                  tweets    at_word
0                    @Obama says goodbye      Obama
1                     Retweets for @cash       cash
2  A political endorsement in @Indonesia  Indonesia
3                 1 dog = many #retweets
4                     Just a simple #egg

#### Write a Pandas program to extract only number from the specified column of a given DataFrame.

In [13]:
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'company_code': ['c0001','c0002','c0003', 'c0003', 'c0004'],
    'address': ['7277 Surrey Ave.','920 N. Bishop Ave.','9910 Golden Star St.', '25 Dunbar St.', '17 West Livingston Court']
    })
print("Original DataFrame:")
df

Original DataFrame:

  company_code                   address
0        c0001          7277 Surrey Ave.
1        c0002        920 N. Bishop Ave.
2        c0003      9910 Golden Star St.
3        c0003             25 Dunbar St.
4        c0004  17 West Livingston Court

In [14]:
def find_number(text):
    num = re.findall(r'[0-9]+',text)
    return " ".join(num)

In [15]:
df['number']=df['address'].apply(lambda x: find_number(x))
df

  company_code                   address number
0        c0001          7277 Surrey Ave.   7277
1        c0002        920 N. Bishop Ave.    920
2        c0003      9910 Golden Star St.   9910
3        c0003             25 Dunbar St.     25
4        c0004  17 West Livingston Court     17

#### Write a Pandas program to extract only phone number from the specified column of a given DataFrame.4

In [17]:
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'company_code': ['c0001','c0002','c0003', 'c0003', 'c0004'],
    'company_phone_no': ['Company1-Phone no. 4695168357','Company2-Phone no. 8088729013','Company3-Phone no. 6204658086', 'Company4-Phone no. 5159530096', 'Company5-Phone no. 9037952371']
    })
print("Original DataFrame:")
df

Original DataFrame:

  company_code               company_phone_no
0        c0001  Company1-Phone no. 4695168357
1        c0002  Company2-Phone no. 8088729013
2        c0003  Company3-Phone no. 6204658086
3        c0003  Company4-Phone no. 5159530096
4        c0004  Company5-Phone no. 9037952371

In [18]:
def find_phone_number(text):
    ph_no = re.findall(r"\b\d{10}\b",text)
    return "".join(ph_no)

In [19]:
df['number']=df['company_phone_no'].apply(lambda x: find_phone_number(x))
df

  company_code               company_phone_no      number
0        c0001  Company1-Phone no. 4695168357  4695168357
1        c0002  Company2-Phone no. 8088729013  8088729013
2        c0003  Company3-Phone no. 6204658086  6204658086
3        c0003  Company4-Phone no. 5159530096  5159530096
4        c0004  Company5-Phone no. 9037952371  9037952371

#### Write a Pandas program to extract year between 1800 to 2200 from the specified column of a given DataFrame.4

In [21]:
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'company_code': ['c0001','c0002','c0003', 'c0003', 'c0004'],
    'year': ['year 1800','year 1700','year 2300', 'year 1900', 'year 2200']
    })
print("Original DataFrame:")

df

Original DataFrame:

  company_code       year
0        c0001  year 1800
1        c0002  year 1700
2        c0003  year 2300
3        c0003  year 1900
4        c0004  year 2200

In [22]:
def find_year(text):
    #line=re.findall(r"\b(18[0][0]|2[0-2][00])\b",text)
    result = re.findall(r"\b(18[0-9]{2}|19[0-8][0-9]|199[0-9]|2[01][0-9]{2}|2200)\b",text)
    return result

df['year_range']=df['year'].apply(lambda x: find_year(x))

df

  company_code       year year_range
0        c0001  year 1800     [1800]
1        c0002  year 1700         []
2        c0003  year 2300         []
3        c0003  year 1900     [1900]
4        c0004  year 2200     [2200]

In [25]:
df['year_range']=df['year_range'].apply(lambda x:''.join(x))
df

  company_code       year year_range
0        c0001  year 1800       1800
1        c0002  year 1700
2        c0003  year 2300
3        c0003  year 1900       1900
4        c0004  year 2200       2200

#### Write a Pandas program to extract only non alphanumeric characters from the specified column of a given DataFrame.

In [26]:
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'company_code': ['c0001#','c00@0^2','$c0003', 'c0003', '&c0004'],
    'year': ['year 1800','year 1700','year 2300', 'year 1900', 'year 2200']
    })
print("Original DataFrame:")

df

Original DataFrame:

  company_code       year
0       c0001#  year 1800
1      c00@0^2  year 1700
2       $c0003  year 2300
3        c0003  year 1900
4       &c0004  year 2200

In [27]:
def find_nonalpha(text):
    result = re.findall("[^A-Za-z0-9 ]",text)
    return result

In [29]:
df['nonalpha']=df['company_code'].apply(lambda x: find_nonalpha(x))
print("\nExtracting only non alphanumeric characters from company_code:")
df

Extracting only non alphanumeric characters from company_code:

  company_code       year nonalpha
0       c0001#  year 1800      [#]
1      c00@0^2  year 1700   [@, ^]
2       $c0003  year 2300      [$]
3        c0003  year 1900       []
4       &c0004  year 2200      [&]

#### Write a Pandas program to extract only punctuations from the specified column of a given DataFrame.

In [30]:
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'company_code': ['c0001.','c000,2','c0003', 'c0003#', 'c0004,'],
    'year': ['year 1800','year 1700','year 2300', 'year 1900', 'year 2200']
    })
print("Original DataFrame:")
df

Original DataFrame:

  company_code       year
0       c0001.  year 1800
1       c000,2  year 1700
2        c0003  year 2300
3       c0003#  year 1900
4       c0004,  year 2200

In [32]:
def find_punctuations(text):
    result = re.findall(r'[!"\$%&\'()*+,\-.\/:;=#@?\[\\\]^_`{|}~]*', text)
    string="".join(result)
    return list(string)

In [33]:
df['nonalpha']=df['company_code'].apply(lambda x: find_punctuations(x))
print("\nExtracting punctuation:")
df

Extracting punctuation:

  company_code       year nonalpha
0       c0001.  year 1800      [.]
1       c000,2  year 1700      [,]
2        c0003  year 2300       []
3       c0003#  year 1900      [#]
4       c0004,  year 2200      [,]

#### Write a Pandas program to remove repetitive characters from the specified column of a given DataFrame.

In [34]:
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'text_code': ['t0001.','t0002','t0003', 't0004'],
    'text_lang': ['She livedd a long life.', 'How oold is your father?', 'What is tthe problem?','TThhis desk is used by Tom.']
    })
df

  text_code                    text_lang
0    t0001.      She livedd a long life.
1     t0002     How oold is your father?
2     t0003        What is tthe problem?
3     t0004  TThhis desk is used by Tom.

In [35]:
def rep_char(str1):
    tchr = str1.group(0)
    if len(tchr) > 1:
        return tchr[0:1] # can change the value here on repetition

In [36]:
def unique_char(rep, sent_text):
    convert = re.sub(r'(\w)\1+', rep, sent_text) 
    return convert

In [38]:
df['normal_text']=df['text_lang'].apply(lambda x : unique_char(rep_char,x))
print("\nRemove repetitive characters:")
df

Remove repetitive characters:

  text_code                    text_lang                normal_text
0    t0001.      She livedd a long life.     She lived a long life.
1     t0002     How oold is your father?    How old is your father?
2     t0003        What is tthe problem?       What is the problem?
3     t0004  TThhis desk is used by Tom.  This desk is used by Tom.

#### Write a Pandas program to extract numbers greater than 940 from the specified column of a given DataFrame.

In [40]:
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'company_code': ['c0001','c0002','c0003', 'c0003', 'c0004'],
    'address': ['7277 Surrey Ave.1111','920 N. Bishop Ave.','9910 Golden Star St.', '1025 Dunbar St.', '1700 West Livingston Court']
    })
print("Original DataFrame:")

df

Original DataFrame:

  company_code                     address
0        c0001        7277 Surrey Ave.1111
1        c0002          920 N. Bishop Ave.
2        c0003        9910 Golden Star St.
3        c0003             1025 Dunbar St.
4        c0004  1700 West Livingston Court

In [43]:
def test_num_great(text): 
    result = re.findall(r'95[5-9]|9[6-9]\d|[1-9]\d{3,}',text)
    return " ".join(result)

In [44]:
df['num_great']=df['address'].apply(lambda x : test_num_great(x))
print("\nNumber greater than 940:")
df

Number greater than 940:

  company_code                     address  num_great
0        c0001        7277 Surrey Ave.1111  7277 1111
1        c0002          920 N. Bishop Ave.
2        c0003        9910 Golden Star St.        991
3        c0003             1025 Dunbar St.       1025
4        c0004  1700 West Livingston Court       1700

#### Write a Pandas program to extract numbers less than 100 from the specified column of a given DataFrame.

In [45]:
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'company_code': ['c0001','c0002','c0003', 'c0003', 'c0004'],
    'address': ['72 Surrey Ave.11','92 N. Bishop Ave.','9910 Golden Star St.', '102 Dunbar St.', '17 West Livingston Court']
    })
print("Original DataFrame:")
df

Original DataFrame:

  company_code                   address
0        c0001          72 Surrey Ave.11
1        c0002         92 N. Bishop Ave.
2        c0003      9910 Golden Star St.
3        c0003            102 Dunbar St.
4        c0004  17 West Livingston Court

In [46]:
def test_num_less(n):
    nums = []
    for i in n.split():
        result = re.findall(r'\b(0*(?:[1-9][0-9]?|100))\b',i)
        nums.append(result)
        all_num=[",".join(x) for x in nums if x != []]
    return " ".join(all_num)

In [47]:

df['num_less'] = df['address'].apply(lambda x : test_num_less(x))
print("\nNumber less than 100:")
df

Number less than 100:

  company_code                   address num_less
0        c0001          72 Surrey Ave.11    72 11
1        c0002         92 N. Bishop Ave.       92
2        c0003      9910 Golden Star St.
3        c0003            102 Dunbar St.
4        c0004  17 West Livingston Court       17

#### Write a Pandas program to check whether two given words present in a specified column of a given DataFrame.

In [48]:
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'company_code': ['c0001','c0002','c0003', 'c0003', 'c0004'],
    'address': ['9910 Surrey Ave.','92 N. Bishop Ave.','9910 Golden Star Ave.', '102 Dunbar St.', '17 West Livingston Court']
    })
print("Original DataFrame:")
df

Original DataFrame:

  company_code                   address
0        c0001          9910 Surrey Ave.
1        c0002         92 N. Bishop Ave.
2        c0003     9910 Golden Star Ave.
3        c0003            102 Dunbar St.
4        c0004  17 West Livingston Court

In [49]:
def test_and_cond(text):
    result = re.findall(r'(?=.*Ave.)(?=.*9910).*', text) 
    return " ".join(result)
df['check_two_words']=df['address'].apply(lambda x : test_and_cond(x))
print("\nPresent two words!")
df

Present two words!

  company_code                   address        check_two_words
0        c0001          9910 Surrey Ave.       9910 Surrey Ave.
1        c0002         92 N. Bishop Ave.
2        c0003     9910 Golden Star Ave.  9910 Golden Star Ave.
3        c0003            102 Dunbar St.
4        c0004  17 West Livingston Court

#### Write a Pandas program to extract date (format: mm-dd-yyyy) from a given column of a given DataFrame.

In [50]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','05/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
print("Original DataFrame:")
df

Original DataFrame:

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      zefsalf   05/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4      zekfsdf   15/09/1997         23.0

In [51]:
def find_valid_dates(dt):
    #format: mm-dd-yyyy
    result = re.findall(r'\b(1[0-2]|0[1-9])/(3[01]|[12][0-9]|0[1-9])/([0-9]{4})\b',dt)
    return result

In [52]:
df['valid_dates']=df['date_of_sale'].apply(lambda dt : find_valid_dates(dt))
print("\nValid dates (format: mm-dd-yyyy):")
df

Valid dates (format: mm-dd-yyyy):

  company_code date_of_sale  sale_amount       valid_dates
0         Abcd   12/05/2002      12348.5  [(12, 05, 2002)]
1         EFGF   16/02/1999     233331.2                []
2      zefsalf   05/09/1998         22.5  [(05, 09, 1998)]
3      sdfslew   12/02/2022    2566552.0  [(12, 02, 2022)]
4      zekfsdf   15/09/1997         23.0                []

#### Write a Pandas program to extract only words from a given column of a given DataFrame.

In [53]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','05/09/1998','12/02/2022','15/09/1997'],
    'address': ['9910 Surrey Ave.','92 N. Bishop Ave.','9910 Golden Star Ave.', '102 Dunbar St.', '17 West Livingston Court']
})
print("Original DataFrame:")
df

Original DataFrame:

  company_code date_of_sale                   address
0         Abcd   12/05/2002          9910 Surrey Ave.
1         EFGF   16/02/1999         92 N. Bishop Ave.
2      zefsalf   05/09/1998     9910 Golden Star Ave.
3      sdfslew   12/02/2022            102 Dunbar St.
4      zekfsdf   15/09/1997  17 West Livingston Court

In [54]:
def search_words(text):
    result = re.findall(r'\b[^\d\W]+\b', text)
    return " ".join(result)

In [55]:
df['only_words']=df['address'].apply(lambda x : search_words(x))
print("\nOnly words:")
df

Only words:

  company_code date_of_sale                   address             only_words
0         Abcd   12/05/2002          9910 Surrey Ave.             Surrey Ave
1         EFGF   16/02/1999         92 N. Bishop Ave.           N Bishop Ave
2      zefsalf   05/09/1998     9910 Golden Star Ave.        Golden Star Ave
3      sdfslew   12/02/2022            102 Dunbar St.              Dunbar St
4      zekfsdf   15/09/1997  17 West Livingston Court  West Livingston Court

#### Write a Pandas program to extract words starting with capital words from a given column of a given DataFrame.

In [57]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','05/09/1998','12/02/2022','15/09/1997'],
    'address': ['9910 Surrey Avenue','92 N. Bishop Avenue','9910 Golden Star Avenue', '102 Dunbar St.', '17 West Livingston Court']
})

print("Original DataFrame:")
df

Original DataFrame:

  company_code date_of_sale                   address
0         Abcd   12/05/2002        9910 Surrey Avenue
1         EFGF   16/02/1999       92 N. Bishop Avenue
2      zefsalf   05/09/1998   9910 Golden Star Avenue
3      sdfslew   12/02/2022            102 Dunbar St.
4      zekfsdf   15/09/1997  17 West Livingston Court

In [58]:
def find_capital_word(str1):
    result = re.findall(r'\b[A-Z]\w+', str1)
    return result
df['caps_word_in']=df['address'].apply(lambda cw : find_capital_word(cw))
df

,company_code,date_of_sale,address,caps_word_in
0,Abcd,12/05/2002,9910 Surrey Avenue,"[Surrey, Avenue]"
1,EFGF,16/02/1999,92 N. Bishop Avenue,"[Bishop, Avenue]"
2,zefsalf,05/09/1998,9910 Golden Star Avenue,"[Golden, Star, Avenue]"
3,sdfslew,12/02/2022,102 Dunbar St.,"[Dunbar, St]"
4,zekfsdf,15/09/1997,17 West Livingston Court,"[West, Livingston, Court]"

In [59]:
print("\nExtract words starting with capital words from the sentences':")
df

Extract words starting with capital words from the sentences':

,company_code,date_of_sale,address,caps_word_in
0,Abcd,12/05/2002,9910 Surrey Avenue,"[Surrey, Avenue]"
1,EFGF,16/02/1999,92 N. Bishop Avenue,"[Bishop, Avenue]"
2,zefsalf,05/09/1998,9910 Golden Star Avenue,"[Golden, Star, Avenue]"
3,sdfslew,12/02/2022,102 Dunbar St.,"[Dunbar, St]"
4,zekfsdf,15/09/1997,17 West Livingston Court,"[West, Livingston, Court]"